ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define CLC1CONH CLC1CONH
extern volatile uint16_t  CLC1CONH __attribute__((__sfr__));
typedef struct tagCLC1CONHBITS {
  uint16_t G1POL:1;
  uint16_t G2POL:1;
  uint16_t G3POL:1;
  uint16_t G4POL:1;
} CLC1CONHBITS;
extern volatile CLC1CONHBITS CLC1CONHbits __attribute__((__sfr__));

#define CLC1SEL CLC1SEL
extern volatile uint16_t  CLC1SEL __attribute__((__sfr__));
__extension__ typedef struct tagCLC1SELBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC1SELBITS;
extern volatile CLC1SELBITS CLC1SELbits __attribute__((__sfr__));

#define CLC1SELL CLC1SELL
extern volatile uint16_t  CLC1SELL __attribute__((__sfr__));
__extension__ typedef struct tagCLC1SELLBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC1SELLBITS;
extern volatile CLC1SELLBITS CLC1SELLbits __attribute__((__sfr__));

#define CLC1GLSL CLC1GLSL
extern volatile uint16_t  CLC1GLSL __attribute__((__sfr__));
typedef struct tagCLC1GLSLBITS {
  uint16_t G1D1N:1;
  uint16_t G1D1T:1;
  uint16_t G1D2N:1;
  uint16_t G1D2T:1;
  uint16_t G1D3N:1;
  uint16_t G1D3T:1;
  uint16_t G1D4N:1;
  uint16_t G1D4T:1;
  uint16_t G2D1N:1;
  uint16_t G2D1T:1;
  uint16_t G2D2N:1;
  uint16_t G2D2T:1;
  uint16_t G2D3N:1;
  uint16_t G2D3T:1;
  uint16_t G2D4N:1;
  uint16_t G2D4T:1;
} CLC1GLSLBITS;
extern volatile CLC1GLSLBITS CLC1GLSLbits __attribute__((__sfr__));

#define CLC1GLSH CLC1GLSH
extern volatile uint16_t  CLC1GLSH __attribute__((__sfr__));
typedef struct tagCLC1GLSHBITS {
  uint16_t G3D1N:1;
  uint16_t G3D1T:1;
  uint16_t G3D2N:1;
  uint16_t G3D2T:1;
  uint16_t G3D3N:1;
  uint16_t G3D3T:1;
  uint16_t G3D4N:1;
  uint16_t G3D4T:1;
  uint16_t G4D1N:1;
  uint16_t G4D1T:1;
  uint16_t G4D2N:1;
  uint16_t G4D2T:1;
  uint16_t G4D3N:1;
  uint16_t G4D3T:1;
  uint16_t G4D4N:1;
  uint16_t G4D4T:1;
} CLC1GLSHBITS;
extern volatile CLC1GLSHBITS CLC1GLSHbits __attribute__((__sfr__));

#define CLC2CONL CLC2CONL
extern volatile uint16_t  CLC2CONL __attribute__((__sfr__));
__extension__ typedef struct tagCLC2CONLBITS {
  union {
    struct {
      uint16_t MODE:3;
      uint16_t :2;
      uint16_t LCPOL:1;
      uint16_t LCOUT:1;
      uint16_t LCOE:1;
      uint16_t :2;
      uint16_t INTN:1;
      uint16_t INTP:1;
      uint16_t :3;
      uint16_t LCEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t MODE2:1;
    };
  };
} CLC2CONLBITS;
extern volatile CLC2CONLBITS CLC2CONLbits __attribute__((__sfr__));

#define CLC2CONH CLC2CONH
extern volatile uint16_t  CLC2CONH __attribute__((__sfr__));
typedef struct tagCLC2CONHBITS {
  uint16_t G1POL:1;
  uint16_t G2POL:1;
  uint16_t G3POL:1;
  uint16_t G4POL:1;
} CLC2CONHBITS;
extern volatile CLC2CONHBITS CLC2CONHbits __attribute__((__sfr__));

#define CLC2SEL CLC2SEL
extern volatile uint16_t  CLC2SEL __attribute__((__sfr__));
__extension__ typedef struct tagCLC2SELBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC2SELBITS;
extern volatile CLC2SELBITS CLC2SELbits __attribute__((__sfr__));

#define CLC2SELL CLC2SELL
extern volatile uint16_t  CLC2SELL __attribute__((__sfr__));
__extension__ typedef struct tagCLC2SELLBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC2SELLBITS;
extern volatile CLC2SELLBITS CLC2SELLbits __attribute__((__sfr__));

#define CLC2GLSL CLC2GLSL
extern volatile uint16_t  CLC2GLSL __attribute__((__sfr__));
typedef struct tagCLC2GLSLBITS {
  uint16_t G1D1N:1;
  uint16_t G1D1T:1;
  uint16_t G1D2N:1;
  uint16_t G1D2T:1;
  uint16_t G1D3N:1;
  uint16_t G1D3T:1;
  uint16_t G1D4N:1;
  uint16_t G1D4T:1;
  uint16_t G2D1N:1;
  uint16_t G2D1T:1;
  uint16_t G2D2N:1;
  uint16_t G2D2T:1;
  uint16_t G2D3N:1;
  uint16_t G2D3T:1;
  uint16_t G2D4N:1;
  uint16_t G2D4T:1;
} CLC2GLSLBITS;
extern volatile CLC2GLSLBITS CLC2GLSLbits __attribute__((__sfr__));

#define CLC2GLSH CLC2GLSH
extern volatile uint16_t  CLC2GLSH __attribute__((__sfr__));
typedef struct tagCLC2GLSHBITS {
  uint16_t G3D1N:1;
  uint16_t G3D1T:1;
  uint16_t G3D2N:1;
  uint16_t G3D2T:1;
  uint16_t G3D3N:1;
  uint16_t G3D3T:1;
  uint16_t G3D4N:1;
  uint16_t G3D4T:1;
  uint16_t G4D1N:1;
  uint16_t G4D1T:1;
  uint16_t G4D2N:1;
  uint16_t G4D2T:1;
  uint16_t G4D3N:1;
  uint16_t G4D3T:1;
  uint16_t G4D4N:1;
  uint16_t G4D4T:1;
} CLC2GLSHBITS;
extern volatile CLC2GLSHBITS CLC2GLSHbits __attribute__((__sfr__));

#define CLC3CONL CLC3CONL
extern volatile uint16_t  CLC3CONL __attribute__((__sfr__));
__extension__ typedef struct tagCLC3CONLBITS {
  union {
    struct {
      uint16_t MODE:3;
      uint16_t :2;
      uint16_t LCPOL:1;
      uint16_t LCOUT:1;
      uint16_t LCOE:1;
      uint16_t :2;
      uint16_t INTN:1;
      uint16_t INTP:1;
      uint16_t :3;
      uint16_t LCEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t MODE2:1;
    };
  };
} CLC3CONLBITS;
extern volatile CLC3CONLBITS CLC3CONLbits __attribute__((__sfr__));

#define CLC3CONH CLC3CONH
extern volatile uint16_t  CLC3CONH __attribute__((__sfr__));
typedef struct tagCLC3CONHBITS {
  uint16_t G1POL:1;
  uint16_t G2POL:1;
  uint16_t G3POL:1;
  uint16_t G4POL:1;
} CLC3CONHBITS;
extern volatile CLC3CONHBITS CLC3CONHbits __attribute__((__sfr__));

