ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define CLC3SEL CLC3SEL
extern volatile uint16_t  CLC3SEL __attribute__((__sfr__));
__extension__ typedef struct tagCLC3SELBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC3SELBITS;
extern volatile CLC3SELBITS CLC3SELbits __attribute__((__sfr__));

#define CLC3SELL CLC3SELL
extern volatile uint16_t  CLC3SELL __attribute__((__sfr__));
__extension__ typedef struct tagCLC3SELLBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC3SELLBITS;
extern volatile CLC3SELLBITS CLC3SELLbits __attribute__((__sfr__));

#define CLC3GLSL CLC3GLSL
extern volatile uint16_t  CLC3GLSL __attribute__((__sfr__));
typedef struct tagCLC3GLSLBITS {
  uint16_t G1D1N:1;
  uint16_t G1D1T:1;
  uint16_t G1D2N:1;
  uint16_t G1D2T:1;
  uint16_t G1D3N:1;
  uint16_t G1D3T:1;
  uint16_t G1D4N:1;
  uint16_t G1D4T:1;
  uint16_t G2D1N:1;
  uint16_t G2D1T:1;
  uint16_t G2D2N:1;
  uint16_t G2D2T:1;
  uint16_t G2D3N:1;
  uint16_t G2D3T:1;
  uint16_t G2D4N:1;
  uint16_t G2D4T:1;
} CLC3GLSLBITS;
extern volatile CLC3GLSLBITS CLC3GLSLbits __attribute__((__sfr__));

#define CLC3GLSH CLC3GLSH
extern volatile uint16_t  CLC3GLSH __attribute__((__sfr__));
typedef struct tagCLC3GLSHBITS {
  uint16_t G3D1N:1;
  uint16_t G3D1T:1;
  uint16_t G3D2N:1;
  uint16_t G3D2T:1;
  uint16_t G3D3N:1;
  uint16_t G3D3T:1;
  uint16_t G3D4N:1;
  uint16_t G3D4T:1;
  uint16_t G4D1N:1;
  uint16_t G4D1T:1;
  uint16_t G4D2N:1;
  uint16_t G4D2T:1;
  uint16_t G4D3N:1;
  uint16_t G4D3T:1;
  uint16_t G4D4N:1;
  uint16_t G4D4T:1;
} CLC3GLSHBITS;
extern volatile CLC3GLSHBITS CLC3GLSHbits __attribute__((__sfr__));

#define CLC4CONL CLC4CONL
extern volatile uint16_t  CLC4CONL __attribute__((__sfr__));
__extension__ typedef struct tagCLC4CONLBITS {
  union {
    struct {
      uint16_t MODE:3;
      uint16_t :2;
      uint16_t LCPOL:1;
      uint16_t LCOUT:1;
      uint16_t LCOE:1;
      uint16_t :2;
      uint16_t INTN:1;
      uint16_t INTP:1;
      uint16_t :3;
      uint16_t LCEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t MODE2:1;
    };
  };
} CLC4CONLBITS;
extern volatile CLC4CONLBITS CLC4CONLbits __attribute__((__sfr__));

#define CLC4CONH CLC4CONH
extern volatile uint16_t  CLC4CONH __attribute__((__sfr__));
typedef struct tagCLC4CONHBITS {
  uint16_t G1POL:1;
  uint16_t G2POL:1;
  uint16_t G3POL:1;
  uint16_t G4POL:1;
} CLC4CONHBITS;
extern volatile CLC4CONHBITS CLC4CONHbits __attribute__((__sfr__));

#define CLC4SEL CLC4SEL
extern volatile uint16_t  CLC4SEL __attribute__((__sfr__));
__extension__ typedef struct tagCLC4SELBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC4SELBITS;
extern volatile CLC4SELBITS CLC4SELbits __attribute__((__sfr__));

#define CLC4SELL CLC4SELL
extern volatile uint16_t  CLC4SELL __attribute__((__sfr__));
__extension__ typedef struct tagCLC4SELLBITS {
  union {
    struct {
      uint16_t DS1:3;
      uint16_t :1;
      uint16_t DS2:3;
      uint16_t :1;
      uint16_t DS3:3;
      uint16_t :1;
      uint16_t DS4:3;
    };
    struct {
      uint16_t DS10:1;
      uint16_t DS11:1;
      uint16_t DS12:1;
      uint16_t :1;
      uint16_t DS20:1;
      uint16_t DS21:1;
      uint16_t DS22:1;
      uint16_t :1;
      uint16_t DS30:1;
      uint16_t DS31:1;
      uint16_t DS32:1;
      uint16_t :1;
      uint16_t DS40:1;
      uint16_t DS41:1;
      uint16_t DS42:1;
    };
  };
} CLC4SELLBITS;
extern volatile CLC4SELLBITS CLC4SELLbits __attribute__((__sfr__));

#define CLC4GLSL CLC4GLSL
extern volatile uint16_t  CLC4GLSL __attribute__((__sfr__));
typedef struct tagCLC4GLSLBITS {
  uint16_t G1D1N:1;
  uint16_t G1D1T:1;
  uint16_t G1D2N:1;
  uint16_t G1D2T:1;
  uint16_t G1D3N:1;
  uint16_t G1D3T:1;
  uint16_t G1D4N:1;
  uint16_t G1D4T:1;
  uint16_t G2D1N:1;
  uint16_t G2D1T:1;
  uint16_t G2D2N:1;
  uint16_t G2D2T:1;
  uint16_t G2D3N:1;
  uint16_t G2D3T:1;
  uint16_t G2D4N:1;
  uint16_t G2D4T:1;
} CLC4GLSLBITS;
extern volatile CLC4GLSLBITS CLC4GLSLbits __attribute__((__sfr__));

#define CLC4GLSH CLC4GLSH
extern volatile uint16_t  CLC4GLSH __attribute__((__sfr__));
typedef struct tagCLC4GLSHBITS {
  uint16_t G3D1N:1;
  uint16_t G3D1T:1;
  uint16_t G3D2N:1;
  uint16_t G3D2T:1;
  uint16_t G3D3N:1;
  uint16_t G3D3T:1;
  uint16_t G3D4N:1;
  uint16_t G3D4T:1;
  uint16_t G4D1N:1;
  uint16_t G4D1T:1;
  uint16_t G4D2N:1;
  uint16_t G4D2T:1;
  uint16_t G4D3N:1;
  uint16_t G4D3T:1;
  uint16_t G4D4N:1;
  uint16_t G4D4T:1;
} CLC4GLSHBITS;
extern volatile CLC4GLSHBITS CLC4GLSHbits __attribute__((__sfr__));

#define I2C1RCV I2C1RCV
extern volatile uint16_t  I2C1RCV __attribute__((__sfr__));
typedef struct tagI2C1RCVBITS {
  uint16_t I2CRXDATA:8;
} I2C1RCVBITS;
extern volatile I2C1RCVBITS I2C1RCVbits __attribute__((__sfr__));

#define I2C1TRN I2C1TRN
extern volatile uint16_t  I2C1TRN __attribute__((__sfr__));
typedef struct tagI2C1TRNBITS {
  uint16_t I2CTXDATA:8;
} I2C1TRNBITS;
extern volatile I2C1TRNBITS I2C1TRNbits __attribute__((__sfr__));

#define I2C1BRG I2C1BRG
extern volatile uint16_t  I2C1BRG __attribute__((__sfr__));
#define I2C1CON1 I2C1CON1
extern volatile uint16_t  I2C1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagI2C1CON1BITS {
  union {
    struct {
      uint16_t SEN:1;
      uint16_t RSEN:1;
      uint16_t PEN:1;
      uint16_t RCEN:1;
      uint16_t ACKEN:1;
      uint16_t ACKDT:1;
      uint16_t STREN:1;
      uint16_t GCEN:1;
      uint16_t SMEN:1;
      uint16_t DISSLW:1;
      uint16_t A10M:1;
      uint16_t STRICT:1;
      uint16_t SCLREL:1;
      uint16_t I2CSIDL:1;
      uint16_t :1;
      uint16_t I2CEN:1;
    };
    struct {
      uint16_t :13;
      uint16_t SIDL:1;
    };
  };
} I2C1CON1BITS;
extern volatile I2C1CON1BITS I2C1CON1bits __attribute__((__sfr__));

#define I2C1CONL I2C1CONL
extern volatile uint16_t  I2C1CONL __attribute__((__sfr__));
__extension__ typedef struct tagI2C1CONLBITS {
  union {
    struct {
      uint16_t SEN:1;
      uint16_t RSEN:1;
      uint16_t PEN:1;
      uint16_t RCEN:1;
      uint16_t ACKEN:1;
      uint16_t ACKDT:1;
      uint16_t STREN:1;
      uint16_t GCEN:1;
      uint16_t SMEN:1;
      uint16_t DISSLW:1;
      uint16_t A10M:1;
      uint16_t STRICT:1;
      uint16_t SCLREL:1;
      uint16_t I2CSIDL:1;
      uint16_t :1;
      uint16_t I2CEN:1;
    };
    struct {
      uint16_t :13;
      uint16_t SIDL:1;
    };
  };
} I2C1CONLBITS;
extern volatile I2C1CONLBITS I2C1CONLbits __attribute__((__sfr__));

#define I2C1CON2 I2C1CON2
extern volatile uint16_t  I2C1CON2 __attribute__((__sfr__));
typedef struct tagI2C1CON2BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
} I2C1CON2BITS;
