ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define ANSD ANSD
extern volatile uint16_t  ANSD __attribute__((__sfr__));
__extension__ typedef struct tagANSDBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
    };
  };
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t  ANSELD __attribute__((__sfr__));
__extension__ typedef struct tagANSELDBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
    };
  };
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define IOCPD IOCPD
extern volatile uint16_t  IOCPD __attribute__((__sfr__));
typedef struct tagIOCPDBITS {
  uint16_t IOCPD0:1;
  uint16_t IOCPD1:1;
  uint16_t IOCPD2:1;
  uint16_t IOCPD3:1;
  uint16_t IOCPD4:1;
  uint16_t IOCPD5:1;
  uint16_t IOCPD6:1;
  uint16_t IOCPD7:1;
  uint16_t IOCPD8:1;
  uint16_t IOCPD9:1;
  uint16_t IOCPD10:1;
  uint16_t IOCPD11:1;
} IOCPDBITS;
extern volatile IOCPDBITS IOCPDbits __attribute__((__sfr__));

#define IOCND IOCND
extern volatile uint16_t  IOCND __attribute__((__sfr__));
typedef struct tagIOCNDBITS {
  uint16_t IOCND0:1;
  uint16_t IOCND1:1;
  uint16_t IOCND2:1;
  uint16_t IOCND3:1;
  uint16_t IOCND4:1;
  uint16_t IOCND5:1;
  uint16_t IOCND6:1;
  uint16_t IOCND7:1;
  uint16_t IOCND8:1;
  uint16_t IOCND9:1;
  uint16_t IOCND10:1;
  uint16_t IOCND11:1;
} IOCNDBITS;
extern volatile IOCNDBITS IOCNDbits __attribute__((__sfr__));

#define IOCFD IOCFD
extern volatile uint16_t  IOCFD __attribute__((__sfr__));
typedef struct tagIOCFDBITS {
  uint16_t IOCFD0:1;
  uint16_t IOCFD1:1;
  uint16_t IOCFD2:1;
  uint16_t IOCFD3:1;
  uint16_t IOCFD4:1;
  uint16_t IOCFD5:1;
  uint16_t IOCFD6:1;
  uint16_t IOCFD7:1;
  uint16_t IOCFD8:1;
  uint16_t IOCFD9:1;
  uint16_t IOCFD10:1;
  uint16_t IOCFD11:1;
} IOCFDBITS;
extern volatile IOCFDBITS IOCFDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t  CNPUD __attribute__((__sfr__));
__extension__ typedef struct tagCNPUDBITS {
  union {
    struct {
      uint16_t IOCPD0:1;
      uint16_t IOCPD1:1;
      uint16_t IOCPD2:1;
      uint16_t IOCPD3:1;
      uint16_t IOCPD4:1;
      uint16_t IOCPD5:1;
      uint16_t IOCPD6:1;
      uint16_t IOCPD7:1;
      uint16_t IOCPD8:1;
      uint16_t IOCPD9:1;
      uint16_t IOCPD10:1;
      uint16_t IOCPD11:1;
    };
    struct {
      uint16_t IOCPUD0:1;
      uint16_t IOCPUD1:1;
      uint16_t IOCPUD2:1;
      uint16_t IOCPUD3:1;
      uint16_t IOCPUD4:1;
      uint16_t IOCPUD5:1;
      uint16_t IOCPUD6:1;
      uint16_t IOCPUD7:1;
      uint16_t IOCPUD8:1;
      uint16_t IOCPUD9:1;
      uint16_t IOCPUD10:1;
      uint16_t IOCPUD11:1;
    };
    struct {
      uint16_t CNPUD0:1;
      uint16_t CNPUD1:1;
      uint16_t CNPUD2:1;
      uint16_t CNPUD3:1;
      uint16_t CNPUD4:1;
      uint16_t CNPUD5:1;
      uint16_t CNPUD6:1;
      uint16_t CNPUD7:1;
      uint16_t CNPUD8:1;
      uint16_t CNPUD9:1;
      uint16_t CNPUD10:1;
      uint16_t CNPUD11:1;
    };
  };
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define IOCPUD IOCPUD
extern volatile uint16_t  IOCPUD __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUDBITS {
  union {
    struct {
      uint16_t IOCPD0:1;
      uint16_t IOCPD1:1;
      uint16_t IOCPD2:1;
      uint16_t IOCPD3:1;
      uint16_t IOCPD4:1;
      uint16_t IOCPD5:1;
      uint16_t IOCPD6:1;
      uint16_t IOCPD7:1;
      uint16_t IOCPD8:1;
      uint16_t IOCPD9:1;
      uint16_t IOCPD10:1;
      uint16_t IOCPD11:1;
    };
    struct {
      uint16_t IOCPUD0:1;
      uint16_t IOCPUD1:1;
      uint16_t IOCPUD2:1;
      uint16_t IOCPUD3:1;
      uint16_t IOCPUD4:1;
      uint16_t IOCPUD5:1;
      uint16_t IOCPUD6:1;
      uint16_t IOCPUD7:1;
      uint16_t IOCPUD8:1;
      uint16_t IOCPUD9:1;
      uint16_t IOCPUD10:1;
      uint16_t IOCPUD11:1;
    };
    struct {
      uint16_t CNPUD0:1;
      uint16_t CNPUD1:1;
      uint16_t CNPUD2:1;
      uint16_t CNPUD3:1;
      uint16_t CNPUD4:1;
      uint16_t CNPUD5:1;
      uint16_t CNPUD6:1;
      uint16_t CNPUD7:1;
      uint16_t CNPUD8:1;
      uint16_t CNPUD9:1;
      uint16_t CNPUD10:1;
      uint16_t CNPUD11:1;
    };
  };
} IOCPUDBITS;
extern volatile IOCPUDBITS IOCPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t  CNPDD __attribute__((__sfr__));
__extension__ typedef struct tagCNPDDBITS {
  union {
    struct {
      uint16_t IOCPDD0:1;
      uint16_t IOCPDD1:1;
      uint16_t IOCPDD2:1;
      uint16_t IOCPDD3:1;
      uint16_t IOCPDD4:1;
      uint16_t IOCPDD5:1;
      uint16_t IOCPDD6:1;
      uint16_t IOCPDD7:1;
      uint16_t IOCPDD8:1;
      uint16_t IOCPDD9:1;
      uint16_t IOCPDD10:1;
      uint16_t IOCPDD11:1;
    };
    struct {
      uint16_t CNPDD0:1;
      uint16_t CNPDD1:1;
      uint16_t CNPDD2:1;
      uint16_t CNPDD3:1;
      uint16_t CNPDD4:1;
      uint16_t CNPDD5:1;
      uint16_t CNPDD6:1;
      uint16_t CNPDD7:1;
      uint16_t CNPDD8:1;
      uint16_t CNPDD9:1;
      uint16_t CNPDD10:1;
      uint16_t CNPDD11:1;
    };
  };
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define IOCPDD IOCPDD
extern volatile uint16_t  IOCPDD __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDDBITS {
  union {
    struct {
      uint16_t IOCPDD0:1;
      uint16_t IOCPDD1:1;
      uint16_t IOCPDD2:1;
      uint16_t IOCPDD3:1;
      uint16_t IOCPDD4:1;
      uint16_t IOCPDD5:1;
      uint16_t IOCPDD6:1;
      uint16_t IOCPDD7:1;
      uint16_t IOCPDD8:1;
      uint16_t IOCPDD9:1;
      uint16_t IOCPDD10:1;
      uint16_t IOCPDD11:1;
    };
    struct {
      uint16_t CNPDD0:1;
      uint16_t CNPDD1:1;
      uint16_t CNPDD2:1;
      uint16_t CNPDD3:1;
      uint16_t CNPDD4:1;
      uint16_t CNPDD5:1;
      uint16_t CNPDD6:1;
      uint16_t CNPDD7:1;
      uint16_t CNPDD8:1;
      uint16_t CNPDD9:1;
      uint16_t CNPDD10:1;
      uint16_t CNPDD11:1;
    };
  };
} IOCPDDBITS;
