ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11

/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD7 ODCDbits.ODCD7
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11

/* ANSD */
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSELD6 ANSDbits.ANSELD6
#define _ANSELD7 ANSDbits.ANSELD7

/* IOCPD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */

/* IOCND */
#define _IOCND0 IOCNDbits.IOCND0
#define _IOCND1 IOCNDbits.IOCND1
#define _IOCND2 IOCNDbits.IOCND2
#define _IOCND3 IOCNDbits.IOCND3
#define _IOCND4 IOCNDbits.IOCND4
#define _IOCND5 IOCNDbits.IOCND5
#define _IOCND6 IOCNDbits.IOCND6
#define _IOCND7 IOCNDbits.IOCND7
#define _IOCND8 IOCNDbits.IOCND8
#define _IOCND9 IOCNDbits.IOCND9
#define _IOCND10 IOCNDbits.IOCND10
#define _IOCND11 IOCNDbits.IOCND11

/* IOCFD */
#define _IOCFD0 IOCFDbits.IOCFD0
#define _IOCFD1 IOCFDbits.IOCFD1
#define _IOCFD2 IOCFDbits.IOCFD2
#define _IOCFD3 IOCFDbits.IOCFD3
#define _IOCFD4 IOCFDbits.IOCFD4
#define _IOCFD5 IOCFDbits.IOCFD5
#define _IOCFD6 IOCFDbits.IOCFD6
#define _IOCFD7 IOCFDbits.IOCFD7
#define _IOCFD8 IOCFDbits.IOCFD8
#define _IOCFD9 IOCFDbits.IOCFD9
#define _IOCFD10 IOCFDbits.IOCFD10
#define _IOCFD11 IOCFDbits.IOCFD11

/* CNPUD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
#define _IOCPUD0 CNPUDbits.IOCPUD0
#define _IOCPUD1 CNPUDbits.IOCPUD1
#define _IOCPUD2 CNPUDbits.IOCPUD2
#define _IOCPUD3 CNPUDbits.IOCPUD3
#define _IOCPUD4 CNPUDbits.IOCPUD4
#define _IOCPUD5 CNPUDbits.IOCPUD5
#define _IOCPUD6 CNPUDbits.IOCPUD6
#define _IOCPUD7 CNPUDbits.IOCPUD7
#define _IOCPUD8 CNPUDbits.IOCPUD8
#define _IOCPUD9 CNPUDbits.IOCPUD9
#define _IOCPUD10 CNPUDbits.IOCPUD10
#define _IOCPUD11 CNPUDbits.IOCPUD11
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11

/* CNPDD */
#define _IOCPDD0 CNPDDbits.IOCPDD0
#define _IOCPDD1 CNPDDbits.IOCPDD1
#define _IOCPDD2 CNPDDbits.IOCPDD2
#define _IOCPDD3 CNPDDbits.IOCPDD3
#define _IOCPDD4 CNPDDbits.IOCPDD4
#define _IOCPDD5 CNPDDbits.IOCPDD5
#define _IOCPDD6 CNPDDbits.IOCPDD6
#define _IOCPDD7 CNPDDbits.IOCPDD7
#define _IOCPDD8 CNPDDbits.IOCPDD8
#define _IOCPDD9 CNPDDbits.IOCPDD9
#define _IOCPDD10 CNPDDbits.IOCPDD10
#define _IOCPDD11 CNPDDbits.IOCPDD11
#define _CNPDD0 CNPDDbits.CNPDD0
#define _CNPDD1 CNPDDbits.CNPDD1
#define _CNPDD2 CNPDDbits.CNPDD2
#define _CNPDD3 CNPDDbits.CNPDD3
#define _CNPDD4 CNPDDbits.CNPDD4
#define _CNPDD5 CNPDDbits.CNPDD5
#define _CNPDD6 CNPDDbits.CNPDD6
#define _CNPDD7 CNPDDbits.CNPDD7
#define _CNPDD8 CNPDDbits.CNPDD8
#define _CNPDD9 CNPDDbits.CNPDD9
#define _CNPDD10 CNPDDbits.CNPDD10
#define _CNPDD11 CNPDDbits.CNPDD11

/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7

/* ODCE */
#define _ODCE0 ODCEbits.ODCE0
#define _ODCE1 ODCEbits.ODCE1
#define _ODCE2 ODCEbits.ODCE2
#define _ODCE3 ODCEbits.ODCE3
#define _ODCE4 ODCEbits.ODCE4
#define _ODCE5 ODCEbits.ODCE5
#define _ODCE6 ODCEbits.ODCE6
#define _ODCE7 ODCEbits.ODCE7

