ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define _RTCCON1L_RTCOE_POSITION                 0x00000007
#define _RTCCON1L_RTCOE_MASK                     0x00000080
#define _RTCCON1L_RTCOE_LENGTH                   0x00000001

#define _RTCCON1L_PWCPOE_POSITION                0x00000008
#define _RTCCON1L_PWCPOE_MASK                    0x00000100
#define _RTCCON1L_PWCPOE_LENGTH                  0x00000001

#define _RTCCON1L_PWCPOL_POSITION                0x00000009
#define _RTCCON1L_PWCPOL_MASK                    0x00000200
#define _RTCCON1L_PWCPOL_LENGTH                  0x00000001

#define _RTCCON1L_PWCEN_POSITION                 0x0000000A
#define _RTCCON1L_PWCEN_MASK                     0x00000400
#define _RTCCON1L_PWCEN_LENGTH                   0x00000001

#define _RTCCON1L_WRLOCK_POSITION                0x0000000B
#define _RTCCON1L_WRLOCK_MASK                    0x00000800
#define _RTCCON1L_WRLOCK_LENGTH                  0x00000001

#define _RTCCON1L_RTCEN_POSITION                 0x0000000F
#define _RTCCON1L_RTCEN_MASK                     0x00008000
#define _RTCCON1L_RTCEN_LENGTH                   0x00000001

#define _RTCCON1H_ALMRPT_POSITION                0x00000000
#define _RTCCON1H_ALMRPT_MASK                    0x000000FF
#define _RTCCON1H_ALMRPT_LENGTH                  0x00000008

#define _RTCCON1H_AMASK_POSITION                 0x00000008
#define _RTCCON1H_AMASK_MASK                     0x00000F00
#define _RTCCON1H_AMASK_LENGTH                   0x00000004

#define _RTCCON1H_CHIME_POSITION                 0x0000000E
#define _RTCCON1H_CHIME_MASK                     0x00004000
#define _RTCCON1H_CHIME_LENGTH                   0x00000001

#define _RTCCON1H_ALRMEN_POSITION                0x0000000F
#define _RTCCON1H_ALRMEN_MASK                    0x00008000
#define _RTCCON1H_ALRMEN_LENGTH                  0x00000001

#define _RTCCON2L_CLKSEL_POSITION                0x00000000
#define _RTCCON2L_CLKSEL_MASK                    0x00000003
#define _RTCCON2L_CLKSEL_LENGTH                  0x00000002

#define _RTCCON2L_PS_POSITION                    0x00000004
#define _RTCCON2L_PS_MASK                        0x00000030
#define _RTCCON2L_PS_LENGTH                      0x00000002

#define _RTCCON2L_PWCPS_POSITION                 0x00000006
#define _RTCCON2L_PWCPS_MASK                     0x000000C0
#define _RTCCON2L_PWCPS_LENGTH                   0x00000002

#define _RTCCON2L_FDIV_POSITION                  0x0000000B
#define _RTCCON2L_FDIV_MASK                      0x0000F800
#define _RTCCON2L_FDIV_LENGTH                    0x00000005

#define _RTCCON3L_PWCSTAB_POSITION               0x00000000
#define _RTCCON3L_PWCSTAB_MASK                   0x000000FF
#define _RTCCON3L_PWCSTAB_LENGTH                 0x00000008

#define _RTCCON3L_PWCSAMP_POSITION               0x00000008
#define _RTCCON3L_PWCSAMP_MASK                   0x0000FF00
#define _RTCCON3L_PWCSAMP_LENGTH                 0x00000008

#define _RTCSTATL_HALFSEC_POSITION               0x00000000
#define _RTCSTATL_HALFSEC_MASK                   0x00000001
#define _RTCSTATL_HALFSEC_LENGTH                 0x00000001

#define _RTCSTATL_ALMSYNC_POSITION               0x00000001
#define _RTCSTATL_ALMSYNC_MASK                   0x00000002
#define _RTCSTATL_ALMSYNC_LENGTH                 0x00000001

#define _RTCSTATL_SYNC_POSITION                  0x00000002
#define _RTCSTATL_SYNC_MASK                      0x00000004
#define _RTCSTATL_SYNC_LENGTH                    0x00000001

#define _RTCSTATL_TSAEVT_POSITION                0x00000003
#define _RTCSTATL_TSAEVT_MASK                    0x00000008
#define _RTCSTATL_TSAEVT_LENGTH                  0x00000001

#define _RTCSTATL_ALMEVT_POSITION                0x00000005
#define _RTCSTATL_ALMEVT_MASK                    0x00000020
#define _RTCSTATL_ALMEVT_LENGTH                  0x00000001

#define _TIMEL_SECONE_POSITION                   0x00000008
#define _TIMEL_SECONE_MASK                       0x00000F00
#define _TIMEL_SECONE_LENGTH                     0x00000004

#define _TIMEL_SECTEN_POSITION                   0x0000000C
#define _TIMEL_SECTEN_MASK                       0x00007000
#define _TIMEL_SECTEN_LENGTH                     0x00000003

#define _TIMEH_MINONE_POSITION                   0x00000000
#define _TIMEH_MINONE_MASK                       0x0000000F
#define _TIMEH_MINONE_LENGTH                     0x00000004

#define _TIMEH_MINTEN_POSITION                   0x00000004
#define _TIMEH_MINTEN_MASK                       0x00000070
#define _TIMEH_MINTEN_LENGTH                     0x00000003

#define _TIMEH_HRONE_POSITION                    0x00000008
#define _TIMEH_HRONE_MASK                        0x00000F00
#define _TIMEH_HRONE_LENGTH                      0x00000004

#define _TIMEH_HRTEN_POSITION                    0x0000000C
#define _TIMEH_HRTEN_MASK                        0x00003000
#define _TIMEH_HRTEN_LENGTH                      0x00000002

#define _DATEL_WDAY_POSITION                     0x00000000
#define _DATEL_WDAY_MASK                         0x00000007
#define _DATEL_WDAY_LENGTH                       0x00000003

#define _DATEL_DAYONE_POSITION                   0x00000008
#define _DATEL_DAYONE_MASK                       0x00000F00
#define _DATEL_DAYONE_LENGTH                     0x00000004

#define _DATEL_DAYTEN_POSITION                   0x0000000C
#define _DATEL_DAYTEN_MASK                       0x00003000
#define _DATEL_DAYTEN_LENGTH                     0x00000002

#define _DATEH_MTHONE_POSITION                   0x00000000
#define _DATEH_MTHONE_MASK                       0x0000000F
#define _DATEH_MTHONE_LENGTH                     0x00000004

#define _DATEH_MTHTEN_POSITION                   0x00000004
#define _DATEH_MTHTEN_MASK                       0x00000010
#define _DATEH_MTHTEN_LENGTH                     0x00000001

#define _DATEH_YRONE_POSITION                    0x00000008
#define _DATEH_YRONE_MASK                        0x00000F00
#define _DATEH_YRONE_LENGTH                      0x00000004

#define _DATEH_YRTEN_POSITION                    0x0000000C
#define _DATEH_YRTEN_MASK                        0x0000F000
#define _DATEH_YRTEN_LENGTH                      0x00000004

#define _ALMTIMEL_SECONE_POSITION                0x00000008
#define _ALMTIMEL_SECONE_MASK                    0x00000F00
#define _ALMTIMEL_SECONE_LENGTH                  0x00000004

#define _ALMTIMEL_SECTEN_POSITION                0x0000000C
#define _ALMTIMEL_SECTEN_MASK                    0x00007000
#define _ALMTIMEL_SECTEN_LENGTH                  0x00000003

