ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define _IC6CON1_ICM0_POSITION                   0x00000000
#define _IC6CON1_ICM0_MASK                       0x00000001
#define _IC6CON1_ICM0_LENGTH                     0x00000001

#define _IC6CON1_ICM1_POSITION                   0x00000001
#define _IC6CON1_ICM1_MASK                       0x00000002
#define _IC6CON1_ICM1_LENGTH                     0x00000001

#define _IC6CON1_ICM2_POSITION                   0x00000002
#define _IC6CON1_ICM2_MASK                       0x00000004
#define _IC6CON1_ICM2_LENGTH                     0x00000001

#define _IC6CON1_ICI0_POSITION                   0x00000005
#define _IC6CON1_ICI0_MASK                       0x00000020
#define _IC6CON1_ICI0_LENGTH                     0x00000001

#define _IC6CON1_ICI1_POSITION                   0x00000006
#define _IC6CON1_ICI1_MASK                       0x00000040
#define _IC6CON1_ICI1_LENGTH                     0x00000001

#define _IC6CON1_ICTSEL0_POSITION                0x0000000A
#define _IC6CON1_ICTSEL0_MASK                    0x00000400
#define _IC6CON1_ICTSEL0_LENGTH                  0x00000001

#define _IC6CON1_ICTSEL1_POSITION                0x0000000B
#define _IC6CON1_ICTSEL1_MASK                    0x00000800
#define _IC6CON1_ICTSEL1_LENGTH                  0x00000001

#define _IC6CON1_ICTSEL2_POSITION                0x0000000C
#define _IC6CON1_ICTSEL2_MASK                    0x00001000
#define _IC6CON1_ICTSEL2_LENGTH                  0x00000001

#define _IC6CON2_SYNCSEL_POSITION                0x00000000
#define _IC6CON2_SYNCSEL_MASK                    0x0000001F
#define _IC6CON2_SYNCSEL_LENGTH                  0x00000005

#define _IC6CON2_TRIGSTAT_POSITION               0x00000006
#define _IC6CON2_TRIGSTAT_MASK                   0x00000040
#define _IC6CON2_TRIGSTAT_LENGTH                 0x00000001

#define _IC6CON2_ICTRIG_POSITION                 0x00000007
#define _IC6CON2_ICTRIG_MASK                     0x00000080
#define _IC6CON2_ICTRIG_LENGTH                   0x00000001

#define _IC6CON2_IC32_POSITION                   0x00000008
#define _IC6CON2_IC32_MASK                       0x00000100
#define _IC6CON2_IC32_LENGTH                     0x00000001

#define _IC6CON2_SYNCSEL0_POSITION               0x00000000
#define _IC6CON2_SYNCSEL0_MASK                   0x00000001
#define _IC6CON2_SYNCSEL0_LENGTH                 0x00000001

#define _IC6CON2_SYNCSEL1_POSITION               0x00000001
#define _IC6CON2_SYNCSEL1_MASK                   0x00000002
#define _IC6CON2_SYNCSEL1_LENGTH                 0x00000001

#define _IC6CON2_SYNCSEL2_POSITION               0x00000002
#define _IC6CON2_SYNCSEL2_MASK                   0x00000004
#define _IC6CON2_SYNCSEL2_LENGTH                 0x00000001

#define _IC6CON2_SYNCSEL3_POSITION               0x00000003
#define _IC6CON2_SYNCSEL3_MASK                   0x00000008
#define _IC6CON2_SYNCSEL3_LENGTH                 0x00000001

#define _IC6CON2_SYNCSEL4_POSITION               0x00000004
#define _IC6CON2_SYNCSEL4_MASK                   0x00000010
#define _IC6CON2_SYNCSEL4_LENGTH                 0x00000001

#define _OC1CON1_OCM_POSITION                    0x00000000
#define _OC1CON1_OCM_MASK                        0x00000007
#define _OC1CON1_OCM_LENGTH                      0x00000003

#define _OC1CON1_TRIGMODE_POSITION               0x00000003
#define _OC1CON1_TRIGMODE_MASK                   0x00000008
#define _OC1CON1_TRIGMODE_LENGTH                 0x00000001

#define _OC1CON1_OCFLT0_POSITION                 0x00000004
#define _OC1CON1_OCFLT0_MASK                     0x00000010
#define _OC1CON1_OCFLT0_LENGTH                   0x00000001

#define _OC1CON1_OCFLT1_POSITION                 0x00000005
#define _OC1CON1_OCFLT1_MASK                     0x00000020
#define _OC1CON1_OCFLT1_LENGTH                   0x00000001

#define _OC1CON1_OCFLT2_POSITION                 0x00000006
#define _OC1CON1_OCFLT2_MASK                     0x00000040
#define _OC1CON1_OCFLT2_LENGTH                   0x00000001

#define _OC1CON1_ENFLT0_POSITION                 0x00000007
#define _OC1CON1_ENFLT0_MASK                     0x00000080
#define _OC1CON1_ENFLT0_LENGTH                   0x00000001

#define _OC1CON1_ENFLT1_POSITION                 0x00000008
#define _OC1CON1_ENFLT1_MASK                     0x00000100
#define _OC1CON1_ENFLT1_LENGTH                   0x00000001

#define _OC1CON1_ENFLT2_POSITION                 0x00000009
#define _OC1CON1_ENFLT2_MASK                     0x00000200
#define _OC1CON1_ENFLT2_LENGTH                   0x00000001

#define _OC1CON1_OCTSEL_POSITION                 0x0000000A
#define _OC1CON1_OCTSEL_MASK                     0x00001C00
#define _OC1CON1_OCTSEL_LENGTH                   0x00000003

#define _OC1CON1_OCSIDL_POSITION                 0x0000000D
#define _OC1CON1_OCSIDL_MASK                     0x00002000
#define _OC1CON1_OCSIDL_LENGTH                   0x00000001

#define _OC1CON1_OCM0_POSITION                   0x00000000
#define _OC1CON1_OCM0_MASK                       0x00000001
#define _OC1CON1_OCM0_LENGTH                     0x00000001

#define _OC1CON1_OCM1_POSITION                   0x00000001
#define _OC1CON1_OCM1_MASK                       0x00000002
#define _OC1CON1_OCM1_LENGTH                     0x00000001

#define _OC1CON1_OCM2_POSITION                   0x00000002
#define _OC1CON1_OCM2_MASK                       0x00000004
#define _OC1CON1_OCM2_LENGTH                     0x00000001

#define _OC1CON1_OCFLT_POSITION                  0x00000004
#define _OC1CON1_OCFLT_MASK                      0x00000070
#define _OC1CON1_OCFLT_LENGTH                    0x00000003

#define _OC1CON1_ENFLT_POSITION                  0x00000007
#define _OC1CON1_ENFLT_MASK                      0x00000380
#define _OC1CON1_ENFLT_LENGTH                    0x00000003

#define _OC1CON1_OCTSEL0_POSITION                0x0000000A
#define _OC1CON1_OCTSEL0_MASK                    0x00000400
#define _OC1CON1_OCTSEL0_LENGTH                  0x00000001

#define _OC1CON1_OCTSEL1_POSITION                0x0000000B
#define _OC1CON1_OCTSEL1_MASK                    0x00000800
#define _OC1CON1_OCTSEL1_LENGTH                  0x00000001

#define _OC1CON1_OCTSEL2_POSITION                0x0000000C
#define _OC1CON1_OCTSEL2_MASK                    0x00001000
#define _OC1CON1_OCTSEL2_LENGTH                  0x00000001

#define _OC1CON1_OCFLTA_POSITION                 0x00000004
#define _OC1CON1_OCFLTA_MASK                     0x00000010
#define _OC1CON1_OCFLTA_LENGTH                   0x00000001

#define _OC1CON1_OCFLTB_POSITION                 0x00000005
#define _OC1CON1_OCFLTB_MASK                     0x00000020
#define _OC1CON1_OCFLTB_LENGTH                   0x00000001

#define _OC1CON1_OCFLTC_POSITION                 0x00000006
#define _OC1CON1_OCFLTC_MASK                     0x00000040
#define _OC1CON1_OCFLTC_LENGTH                   0x00000001

#define _OC1CON1_ENFLTA_POSITION                 0x00000007
#define _OC1CON1_ENFLTA_MASK                     0x00000080
#define _OC1CON1_ENFLTA_LENGTH                   0x00000001

#define _OC1CON1_ENFLTB_POSITION                 0x00000008
#define _OC1CON1_ENFLTB_MASK                     0x00000100
#define _OC1CON1_ENFLTB_LENGTH                   0x00000001

#define _OC1CON1_ENFLTC_POSITION                 0x00000009
#define _OC1CON1_ENFLTC_MASK                     0x00000200
#define _OC1CON1_ENFLTC_LENGTH                   0x00000001

#define _OC1CON2_SYNCSEL_POSITION                0x00000000
#define _OC1CON2_SYNCSEL_MASK                    0x0000001F
#define _OC1CON2_SYNCSEL_LENGTH                  0x00000005

#define _OC1CON2_OCTRIS_POSITION                 0x00000005
#define _OC1CON2_OCTRIS_MASK                     0x00000020
#define _OC1CON2_OCTRIS_LENGTH                   0x00000001

#define _OC1CON2_TRIGSTAT_POSITION               0x00000006
#define _OC1CON2_TRIGSTAT_MASK                   0x00000040
#define _OC1CON2_TRIGSTAT_LENGTH                 0x00000001

