ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define _CNPDB_IOCPDB10_POSITION                 0x0000000A
#define _CNPDB_IOCPDB10_MASK                     0x00000400
#define _CNPDB_IOCPDB10_LENGTH                   0x00000001

#define _CNPDB_IOCPDB11_POSITION                 0x0000000B
#define _CNPDB_IOCPDB11_MASK                     0x00000800
#define _CNPDB_IOCPDB11_LENGTH                   0x00000001

#define _CNPDB_IOCPDB12_POSITION                 0x0000000C
#define _CNPDB_IOCPDB12_MASK                     0x00001000
#define _CNPDB_IOCPDB12_LENGTH                   0x00000001

#define _CNPDB_IOCPDB13_POSITION                 0x0000000D
#define _CNPDB_IOCPDB13_MASK                     0x00002000
#define _CNPDB_IOCPDB13_LENGTH                   0x00000001

#define _CNPDB_IOCPDB14_POSITION                 0x0000000E
#define _CNPDB_IOCPDB14_MASK                     0x00004000
#define _CNPDB_IOCPDB14_LENGTH                   0x00000001

#define _CNPDB_IOCPDB15_POSITION                 0x0000000F
#define _CNPDB_IOCPDB15_MASK                     0x00008000
#define _CNPDB_IOCPDB15_LENGTH                   0x00000001

#define _CNPDB_CNPDB0_POSITION                   0x00000000
#define _CNPDB_CNPDB0_MASK                       0x00000001
#define _CNPDB_CNPDB0_LENGTH                     0x00000001

#define _CNPDB_CNPDB1_POSITION                   0x00000001
#define _CNPDB_CNPDB1_MASK                       0x00000002
#define _CNPDB_CNPDB1_LENGTH                     0x00000001

#define _CNPDB_CNPDB2_POSITION                   0x00000002
#define _CNPDB_CNPDB2_MASK                       0x00000004
#define _CNPDB_CNPDB2_LENGTH                     0x00000001

#define _CNPDB_CNPDB3_POSITION                   0x00000003
#define _CNPDB_CNPDB3_MASK                       0x00000008
#define _CNPDB_CNPDB3_LENGTH                     0x00000001

#define _CNPDB_CNPDB4_POSITION                   0x00000004
#define _CNPDB_CNPDB4_MASK                       0x00000010
#define _CNPDB_CNPDB4_LENGTH                     0x00000001

#define _CNPDB_CNPDB5_POSITION                   0x00000005
#define _CNPDB_CNPDB5_MASK                       0x00000020
#define _CNPDB_CNPDB5_LENGTH                     0x00000001

#define _CNPDB_CNPDB6_POSITION                   0x00000006
#define _CNPDB_CNPDB6_MASK                       0x00000040
#define _CNPDB_CNPDB6_LENGTH                     0x00000001

#define _CNPDB_CNPDB7_POSITION                   0x00000007
#define _CNPDB_CNPDB7_MASK                       0x00000080
#define _CNPDB_CNPDB7_LENGTH                     0x00000001

#define _CNPDB_CNPDB8_POSITION                   0x00000008
#define _CNPDB_CNPDB8_MASK                       0x00000100
#define _CNPDB_CNPDB8_LENGTH                     0x00000001

#define _CNPDB_CNPDB9_POSITION                   0x00000009
#define _CNPDB_CNPDB9_MASK                       0x00000200
#define _CNPDB_CNPDB9_LENGTH                     0x00000001

#define _CNPDB_CNPDB10_POSITION                  0x0000000A
#define _CNPDB_CNPDB10_MASK                      0x00000400
#define _CNPDB_CNPDB10_LENGTH                    0x00000001

#define _CNPDB_CNPDB11_POSITION                  0x0000000B
#define _CNPDB_CNPDB11_MASK                      0x00000800
#define _CNPDB_CNPDB11_LENGTH                    0x00000001

#define _CNPDB_CNPDB12_POSITION                  0x0000000C
#define _CNPDB_CNPDB12_MASK                      0x00001000
#define _CNPDB_CNPDB12_LENGTH                    0x00000001

#define _CNPDB_CNPDB13_POSITION                  0x0000000D
#define _CNPDB_CNPDB13_MASK                      0x00002000
#define _CNPDB_CNPDB13_LENGTH                    0x00000001

#define _CNPDB_CNPDB14_POSITION                  0x0000000E
#define _CNPDB_CNPDB14_MASK                      0x00004000
#define _CNPDB_CNPDB14_LENGTH                    0x00000001

#define _CNPDB_CNPDB15_POSITION                  0x0000000F
#define _CNPDB_CNPDB15_MASK                      0x00008000
#define _CNPDB_CNPDB15_LENGTH                    0x00000001

#define _IOCPDB_IOCPDB0_POSITION                 0x00000000
#define _IOCPDB_IOCPDB0_MASK                     0x00000001
#define _IOCPDB_IOCPDB0_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB1_POSITION                 0x00000001
#define _IOCPDB_IOCPDB1_MASK                     0x00000002
#define _IOCPDB_IOCPDB1_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB2_POSITION                 0x00000002
#define _IOCPDB_IOCPDB2_MASK                     0x00000004
#define _IOCPDB_IOCPDB2_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB3_POSITION                 0x00000003
#define _IOCPDB_IOCPDB3_MASK                     0x00000008
#define _IOCPDB_IOCPDB3_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB4_POSITION                 0x00000004
#define _IOCPDB_IOCPDB4_MASK                     0x00000010
#define _IOCPDB_IOCPDB4_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB5_POSITION                 0x00000005
#define _IOCPDB_IOCPDB5_MASK                     0x00000020
#define _IOCPDB_IOCPDB5_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB6_POSITION                 0x00000006
#define _IOCPDB_IOCPDB6_MASK                     0x00000040
#define _IOCPDB_IOCPDB6_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB7_POSITION                 0x00000007
#define _IOCPDB_IOCPDB7_MASK                     0x00000080
#define _IOCPDB_IOCPDB7_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB8_POSITION                 0x00000008
#define _IOCPDB_IOCPDB8_MASK                     0x00000100
#define _IOCPDB_IOCPDB8_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB9_POSITION                 0x00000009
#define _IOCPDB_IOCPDB9_MASK                     0x00000200
#define _IOCPDB_IOCPDB9_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB10_POSITION                0x0000000A
#define _IOCPDB_IOCPDB10_MASK                    0x00000400
#define _IOCPDB_IOCPDB10_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB11_POSITION                0x0000000B
#define _IOCPDB_IOCPDB11_MASK                    0x00000800
#define _IOCPDB_IOCPDB11_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB12_POSITION                0x0000000C
#define _IOCPDB_IOCPDB12_MASK                    0x00001000
#define _IOCPDB_IOCPDB12_LENGTH                  0x00000001

