ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define _ODCC_ODCC15_POSITION                    0x0000000F
#define _ODCC_ODCC15_MASK                        0x00008000
#define _ODCC_ODCC15_LENGTH                      0x00000001

#define _ANSC_ANSC13_POSITION                    0x0000000D
#define _ANSC_ANSC13_MASK                        0x00002000
#define _ANSC_ANSC13_LENGTH                      0x00000001

#define _ANSC_ANSC14_POSITION                    0x0000000E
#define _ANSC_ANSC14_MASK                        0x00004000
#define _ANSC_ANSC14_LENGTH                      0x00000001

#define _ANSC_ANSELC13_POSITION                  0x0000000D
#define _ANSC_ANSELC13_MASK                      0x00002000
#define _ANSC_ANSELC13_LENGTH                    0x00000001

#define _ANSC_ANSELC14_POSITION                  0x0000000E
#define _ANSC_ANSELC14_MASK                      0x00004000
#define _ANSC_ANSELC14_LENGTH                    0x00000001

#define _ANSELC_ANSC13_POSITION                  0x0000000D
#define _ANSELC_ANSC13_MASK                      0x00002000
#define _ANSELC_ANSC13_LENGTH                    0x00000001

#define _ANSELC_ANSC14_POSITION                  0x0000000E
#define _ANSELC_ANSC14_MASK                      0x00004000
#define _ANSELC_ANSC14_LENGTH                    0x00000001

#define _ANSELC_ANSELC13_POSITION                0x0000000D
#define _ANSELC_ANSELC13_MASK                    0x00002000
#define _ANSELC_ANSELC13_LENGTH                  0x00000001

#define _ANSELC_ANSELC14_POSITION                0x0000000E
#define _ANSELC_ANSELC14_MASK                    0x00004000
#define _ANSELC_ANSELC14_LENGTH                  0x00000001

#define _IOCPC_IOCPC12_POSITION                  0x0000000C
#define _IOCPC_IOCPC12_MASK                      0x00001000
#define _IOCPC_IOCPC12_LENGTH                    0x00000001

#define _IOCPC_IOCPC13_POSITION                  0x0000000D
#define _IOCPC_IOCPC13_MASK                      0x00002000
#define _IOCPC_IOCPC13_LENGTH                    0x00000001

#define _IOCPC_IOCPC14_POSITION                  0x0000000E
#define _IOCPC_IOCPC14_MASK                      0x00004000
#define _IOCPC_IOCPC14_LENGTH                    0x00000001

#define _IOCPC_IOCPC15_POSITION                  0x0000000F
#define _IOCPC_IOCPC15_MASK                      0x00008000
#define _IOCPC_IOCPC15_LENGTH                    0x00000001

#define _IOCNC_IOCNC12_POSITION                  0x0000000C
#define _IOCNC_IOCNC12_MASK                      0x00001000
#define _IOCNC_IOCNC12_LENGTH                    0x00000001

#define _IOCNC_IOCNC13_POSITION                  0x0000000D
#define _IOCNC_IOCNC13_MASK                      0x00002000
#define _IOCNC_IOCNC13_LENGTH                    0x00000001

#define _IOCNC_IOCNC14_POSITION                  0x0000000E
#define _IOCNC_IOCNC14_MASK                      0x00004000
#define _IOCNC_IOCNC14_LENGTH                    0x00000001

#define _IOCNC_IOCNC15_POSITION                  0x0000000F
#define _IOCNC_IOCNC15_MASK                      0x00008000
#define _IOCNC_IOCNC15_LENGTH                    0x00000001

#define _IOCFC_IOCFC12_POSITION                  0x0000000C
#define _IOCFC_IOCFC12_MASK                      0x00001000
#define _IOCFC_IOCFC12_LENGTH                    0x00000001

#define _IOCFC_IOCFC13_POSITION                  0x0000000D
#define _IOCFC_IOCFC13_MASK                      0x00002000
#define _IOCFC_IOCFC13_LENGTH                    0x00000001

#define _IOCFC_IOCFC14_POSITION                  0x0000000E
#define _IOCFC_IOCFC14_MASK                      0x00004000
#define _IOCFC_IOCFC14_LENGTH                    0x00000001

#define _IOCFC_IOCFC15_POSITION                  0x0000000F
#define _IOCFC_IOCFC15_MASK                      0x00008000
#define _IOCFC_IOCFC15_LENGTH                    0x00000001

#define _CNPUC_IOCPC12_POSITION                  0x0000000C
#define _CNPUC_IOCPC12_MASK                      0x00001000
#define _CNPUC_IOCPC12_LENGTH                    0x00000001

#define _CNPUC_IOCPC13_POSITION                  0x0000000D
#define _CNPUC_IOCPC13_MASK                      0x00002000
#define _CNPUC_IOCPC13_LENGTH                    0x00000001

#define _CNPUC_IOCPC14_POSITION                  0x0000000E
#define _CNPUC_IOCPC14_MASK                      0x00004000
#define _CNPUC_IOCPC14_LENGTH                    0x00000001

#define _CNPUC_IOCPC15_POSITION                  0x0000000F
#define _CNPUC_IOCPC15_MASK                      0x00008000
#define _CNPUC_IOCPC15_LENGTH                    0x00000001

#define _CNPUC_IOCPUC12_POSITION                 0x0000000C
#define _CNPUC_IOCPUC12_MASK                     0x00001000
#define _CNPUC_IOCPUC12_LENGTH                   0x00000001

#define _CNPUC_IOCPUC13_POSITION                 0x0000000D
#define _CNPUC_IOCPUC13_MASK                     0x00002000
#define _CNPUC_IOCPUC13_LENGTH                   0x00000001

#define _CNPUC_IOCPUC14_POSITION                 0x0000000E
#define _CNPUC_IOCPUC14_MASK                     0x00004000
#define _CNPUC_IOCPUC14_LENGTH                   0x00000001

#define _CNPUC_IOCPUC15_POSITION                 0x0000000F
#define _CNPUC_IOCPUC15_MASK                     0x00008000
#define _CNPUC_IOCPUC15_LENGTH                   0x00000001

#define _CNPUC_CNPUC12_POSITION                  0x0000000C
#define _CNPUC_CNPUC12_MASK                      0x00001000
#define _CNPUC_CNPUC12_LENGTH                    0x00000001

#define _CNPUC_CNPUC13_POSITION                  0x0000000D
#define _CNPUC_CNPUC13_MASK                      0x00002000
#define _CNPUC_CNPUC13_LENGTH                    0x00000001

#define _CNPUC_CNPUC14_POSITION                  0x0000000E
#define _CNPUC_CNPUC14_MASK                      0x00004000
#define _CNPUC_CNPUC14_LENGTH                    0x00000001

#define _CNPUC_CNPUC15_POSITION                  0x0000000F
#define _CNPUC_CNPUC15_MASK                      0x00008000
#define _CNPUC_CNPUC15_LENGTH                    0x00000001

#define _IOCPUC_IOCPC12_POSITION                 0x0000000C
#define _IOCPUC_IOCPC12_MASK                     0x00001000
#define _IOCPUC_IOCPC12_LENGTH                   0x00000001

#define _IOCPUC_IOCPC13_POSITION                 0x0000000D
#define _IOCPUC_IOCPC13_MASK                     0x00002000
#define _IOCPUC_IOCPC13_LENGTH                   0x00000001

#define _IOCPUC_IOCPC14_POSITION                 0x0000000E
#define _IOCPUC_IOCPC14_MASK                     0x00004000
#define _IOCPUC_IOCPC14_LENGTH                   0x00000001

#define _IOCPUC_IOCPC15_POSITION                 0x0000000F
#define _IOCPUC_IOCPC15_MASK                     0x00008000
#define _IOCPUC_IOCPC15_LENGTH                   0x00000001

