ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define _ODCE_ODCE3_POSITION                     0x00000003
#define _ODCE_ODCE3_MASK                         0x00000008
#define _ODCE_ODCE3_LENGTH                       0x00000001

#define _ODCE_ODCE4_POSITION                     0x00000004
#define _ODCE_ODCE4_MASK                         0x00000010
#define _ODCE_ODCE4_LENGTH                       0x00000001

#define _ODCE_ODCE5_POSITION                     0x00000005
#define _ODCE_ODCE5_MASK                         0x00000020
#define _ODCE_ODCE5_LENGTH                       0x00000001

#define _ODCE_ODCE6_POSITION                     0x00000006
#define _ODCE_ODCE6_MASK                         0x00000040
#define _ODCE_ODCE6_LENGTH                       0x00000001

#define _ODCE_ODCE7_POSITION                     0x00000007
#define _ODCE_ODCE7_MASK                         0x00000080
#define _ODCE_ODCE7_LENGTH                       0x00000001

#define _ANSE_ANSE4_POSITION                     0x00000004
#define _ANSE_ANSE4_MASK                         0x00000010
#define _ANSE_ANSE4_LENGTH                       0x00000001

#define _ANSE_ANSELE4_POSITION                   0x00000004
#define _ANSE_ANSELE4_MASK                       0x00000010
#define _ANSE_ANSELE4_LENGTH                     0x00000001

#define _ANSELE_ANSE4_POSITION                   0x00000004
#define _ANSELE_ANSE4_MASK                       0x00000010
#define _ANSELE_ANSE4_LENGTH                     0x00000001

#define _ANSELE_ANSELE4_POSITION                 0x00000004
#define _ANSELE_ANSELE4_MASK                     0x00000010
#define _ANSELE_ANSELE4_LENGTH                   0x00000001

#define _IOCPE_IOCPE0_POSITION                   0x00000000
#define _IOCPE_IOCPE0_MASK                       0x00000001
#define _IOCPE_IOCPE0_LENGTH                     0x00000001

#define _IOCPE_IOCPE1_POSITION                   0x00000001
#define _IOCPE_IOCPE1_MASK                       0x00000002
#define _IOCPE_IOCPE1_LENGTH                     0x00000001

#define _IOCPE_IOCPE2_POSITION                   0x00000002
#define _IOCPE_IOCPE2_MASK                       0x00000004
#define _IOCPE_IOCPE2_LENGTH                     0x00000001

#define _IOCPE_IOCPE3_POSITION                   0x00000003
#define _IOCPE_IOCPE3_MASK                       0x00000008
#define _IOCPE_IOCPE3_LENGTH                     0x00000001

#define _IOCPE_IOCPE4_POSITION                   0x00000004
#define _IOCPE_IOCPE4_MASK                       0x00000010
#define _IOCPE_IOCPE4_LENGTH                     0x00000001

#define _IOCPE_IOCPE5_POSITION                   0x00000005
#define _IOCPE_IOCPE5_MASK                       0x00000020
#define _IOCPE_IOCPE5_LENGTH                     0x00000001

#define _IOCPE_IOCPE6_POSITION                   0x00000006
#define _IOCPE_IOCPE6_MASK                       0x00000040
#define _IOCPE_IOCPE6_LENGTH                     0x00000001

#define _IOCPE_IOCPE7_POSITION                   0x00000007
#define _IOCPE_IOCPE7_MASK                       0x00000080
#define _IOCPE_IOCPE7_LENGTH                     0x00000001

#define _IOCNE_IOCNE0_POSITION                   0x00000000
#define _IOCNE_IOCNE0_MASK                       0x00000001
#define _IOCNE_IOCNE0_LENGTH                     0x00000001

#define _IOCNE_IOCNE1_POSITION                   0x00000001
#define _IOCNE_IOCNE1_MASK                       0x00000002
#define _IOCNE_IOCNE1_LENGTH                     0x00000001

#define _IOCNE_IOCNE2_POSITION                   0x00000002
#define _IOCNE_IOCNE2_MASK                       0x00000004
#define _IOCNE_IOCNE2_LENGTH                     0x00000001

#define _IOCNE_IOCNE3_POSITION                   0x00000003
#define _IOCNE_IOCNE3_MASK                       0x00000008
#define _IOCNE_IOCNE3_LENGTH                     0x00000001

#define _IOCNE_IOCNE4_POSITION                   0x00000004
#define _IOCNE_IOCNE4_MASK                       0x00000010
#define _IOCNE_IOCNE4_LENGTH                     0x00000001

#define _IOCNE_IOCNE5_POSITION                   0x00000005
#define _IOCNE_IOCNE5_MASK                       0x00000020
#define _IOCNE_IOCNE5_LENGTH                     0x00000001

#define _IOCNE_IOCNE6_POSITION                   0x00000006
#define _IOCNE_IOCNE6_MASK                       0x00000040
#define _IOCNE_IOCNE6_LENGTH                     0x00000001

#define _IOCNE_IOCNE7_POSITION                   0x00000007
#define _IOCNE_IOCNE7_MASK                       0x00000080
#define _IOCNE_IOCNE7_LENGTH                     0x00000001

#define _IOCFE_IOCFE0_POSITION                   0x00000000
#define _IOCFE_IOCFE0_MASK                       0x00000001
#define _IOCFE_IOCFE0_LENGTH                     0x00000001

#define _IOCFE_IOCFE1_POSITION                   0x00000001
#define _IOCFE_IOCFE1_MASK                       0x00000002
#define _IOCFE_IOCFE1_LENGTH                     0x00000001

#define _IOCFE_IOCFE2_POSITION                   0x00000002
#define _IOCFE_IOCFE2_MASK                       0x00000004
#define _IOCFE_IOCFE2_LENGTH                     0x00000001

#define _IOCFE_IOCFE3_POSITION                   0x00000003
#define _IOCFE_IOCFE3_MASK                       0x00000008
#define _IOCFE_IOCFE3_LENGTH                     0x00000001

#define _IOCFE_IOCFE4_POSITION                   0x00000004
#define _IOCFE_IOCFE4_MASK                       0x00000010
#define _IOCFE_IOCFE4_LENGTH                     0x00000001

#define _IOCFE_IOCFE5_POSITION                   0x00000005
#define _IOCFE_IOCFE5_MASK                       0x00000020
#define _IOCFE_IOCFE5_LENGTH                     0x00000001

#define _IOCFE_IOCFE6_POSITION                   0x00000006
#define _IOCFE_IOCFE6_MASK                       0x00000040
#define _IOCFE_IOCFE6_LENGTH                     0x00000001

#define _IOCFE_IOCFE7_POSITION                   0x00000007
#define _IOCFE_IOCFE7_MASK                       0x00000080
#define _IOCFE_IOCFE7_LENGTH                     0x00000001

#define _CNPUE_IOCPE0_POSITION                   0x00000000
#define _CNPUE_IOCPE0_MASK                       0x00000001
#define _CNPUE_IOCPE0_LENGTH                     0x00000001

#define _CNPUE_IOCPE1_POSITION                   0x00000001
#define _CNPUE_IOCPE1_MASK                       0x00000002
#define _CNPUE_IOCPE1_LENGTH                     0x00000001

#define _CNPUE_IOCPE2_POSITION                   0x00000002
#define _CNPUE_IOCPE2_MASK                       0x00000004
#define _CNPUE_IOCPE2_LENGTH                     0x00000001

#define _CNPUE_IOCPE3_POSITION                   0x00000003
#define _CNPUE_IOCPE3_MASK                       0x00000008
#define _CNPUE_IOCPE3_LENGTH                     0x00000001

