ohilab/libohiboard/include/platforms/PIC24FJ/p24FJ1024GA606.h
#define _IOCPUF_IOCPF4_POSITION                  0x00000004
#define _IOCPUF_IOCPF4_MASK                      0x00000010
#define _IOCPUF_IOCPF4_LENGTH                    0x00000001

#define _IOCPUF_IOCPF5_POSITION                  0x00000005
#define _IOCPUF_IOCPF5_MASK                      0x00000020
#define _IOCPUF_IOCPF5_LENGTH                    0x00000001

#define _IOCPUF_IOCPF6_POSITION                  0x00000006
#define _IOCPUF_IOCPF6_MASK                      0x00000040
#define _IOCPUF_IOCPF6_LENGTH                    0x00000001

#define _IOCPUF_IOCPUF0_POSITION                 0x00000000
#define _IOCPUF_IOCPUF0_MASK                     0x00000001
#define _IOCPUF_IOCPUF0_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF1_POSITION                 0x00000001
#define _IOCPUF_IOCPUF1_MASK                     0x00000002
#define _IOCPUF_IOCPUF1_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF2_POSITION                 0x00000002
#define _IOCPUF_IOCPUF2_MASK                     0x00000004
#define _IOCPUF_IOCPUF2_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF3_POSITION                 0x00000003
#define _IOCPUF_IOCPUF3_MASK                     0x00000008
#define _IOCPUF_IOCPUF3_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF4_POSITION                 0x00000004
#define _IOCPUF_IOCPUF4_MASK                     0x00000010
#define _IOCPUF_IOCPUF4_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF5_POSITION                 0x00000005
#define _IOCPUF_IOCPUF5_MASK                     0x00000020
#define _IOCPUF_IOCPUF5_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF6_POSITION                 0x00000006
#define _IOCPUF_IOCPUF6_MASK                     0x00000040
#define _IOCPUF_IOCPUF6_LENGTH                   0x00000001

#define _IOCPUF_CNPUF0_POSITION                  0x00000000
#define _IOCPUF_CNPUF0_MASK                      0x00000001
#define _IOCPUF_CNPUF0_LENGTH                    0x00000001

#define _IOCPUF_CNPUF1_POSITION                  0x00000001
#define _IOCPUF_CNPUF1_MASK                      0x00000002
#define _IOCPUF_CNPUF1_LENGTH                    0x00000001

#define _IOCPUF_CNPUF2_POSITION                  0x00000002
#define _IOCPUF_CNPUF2_MASK                      0x00000004
#define _IOCPUF_CNPUF2_LENGTH                    0x00000001

#define _IOCPUF_CNPUF3_POSITION                  0x00000003
#define _IOCPUF_CNPUF3_MASK                      0x00000008
#define _IOCPUF_CNPUF3_LENGTH                    0x00000001

#define _IOCPUF_CNPUF4_POSITION                  0x00000004
#define _IOCPUF_CNPUF4_MASK                      0x00000010
#define _IOCPUF_CNPUF4_LENGTH                    0x00000001

#define _IOCPUF_CNPUF5_POSITION                  0x00000005
#define _IOCPUF_CNPUF5_MASK                      0x00000020
#define _IOCPUF_CNPUF5_LENGTH                    0x00000001

#define _IOCPUF_CNPUF6_POSITION                  0x00000006
#define _IOCPUF_CNPUF6_MASK                      0x00000040
#define _IOCPUF_CNPUF6_LENGTH                    0x00000001

#define _CNPDF_IOCPDF0_POSITION                  0x00000000
#define _CNPDF_IOCPDF0_MASK                      0x00000001
#define _CNPDF_IOCPDF0_LENGTH                    0x00000001

#define _CNPDF_IOCPDF1_POSITION                  0x00000001
#define _CNPDF_IOCPDF1_MASK                      0x00000002
#define _CNPDF_IOCPDF1_LENGTH                    0x00000001

#define _CNPDF_IOCPDF2_POSITION                  0x00000002
#define _CNPDF_IOCPDF2_MASK                      0x00000004
#define _CNPDF_IOCPDF2_LENGTH                    0x00000001

#define _CNPDF_IOCPDF3_POSITION                  0x00000003
#define _CNPDF_IOCPDF3_MASK                      0x00000008
#define _CNPDF_IOCPDF3_LENGTH                    0x00000001

#define _CNPDF_IOCPDF4_POSITION                  0x00000004
#define _CNPDF_IOCPDF4_MASK                      0x00000010
#define _CNPDF_IOCPDF4_LENGTH                    0x00000001

#define _CNPDF_IOCPDF5_POSITION                  0x00000005
#define _CNPDF_IOCPDF5_MASK                      0x00000020
#define _CNPDF_IOCPDF5_LENGTH                    0x00000001

#define _CNPDF_IOCPDF6_POSITION                  0x00000006
#define _CNPDF_IOCPDF6_MASK                      0x00000040
#define _CNPDF_IOCPDF6_LENGTH                    0x00000001

#define _CNPDF_CNPDF0_POSITION                   0x00000000
#define _CNPDF_CNPDF0_MASK                       0x00000001
#define _CNPDF_CNPDF0_LENGTH                     0x00000001

#define _CNPDF_CNPDF1_POSITION                   0x00000001
#define _CNPDF_CNPDF1_MASK                       0x00000002
#define _CNPDF_CNPDF1_LENGTH                     0x00000001

#define _CNPDF_CNPDF2_POSITION                   0x00000002
#define _CNPDF_CNPDF2_MASK                       0x00000004
#define _CNPDF_CNPDF2_LENGTH                     0x00000001

#define _CNPDF_CNPDF3_POSITION                   0x00000003
#define _CNPDF_CNPDF3_MASK                       0x00000008
#define _CNPDF_CNPDF3_LENGTH                     0x00000001

#define _CNPDF_CNPDF4_POSITION                   0x00000004
#define _CNPDF_CNPDF4_MASK                       0x00000010
#define _CNPDF_CNPDF4_LENGTH                     0x00000001

#define _CNPDF_CNPDF5_POSITION                   0x00000005
#define _CNPDF_CNPDF5_MASK                       0x00000020
#define _CNPDF_CNPDF5_LENGTH                     0x00000001

#define _CNPDF_CNPDF6_POSITION                   0x00000006
#define _CNPDF_CNPDF6_MASK                       0x00000040
#define _CNPDF_CNPDF6_LENGTH                     0x00000001

#define _IOCPDF_IOCPDF0_POSITION                 0x00000000
#define _IOCPDF_IOCPDF0_MASK                     0x00000001
#define _IOCPDF_IOCPDF0_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF1_POSITION                 0x00000001
#define _IOCPDF_IOCPDF1_MASK                     0x00000002
#define _IOCPDF_IOCPDF1_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF2_POSITION                 0x00000002
#define _IOCPDF_IOCPDF2_MASK                     0x00000004
#define _IOCPDF_IOCPDF2_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF3_POSITION                 0x00000003
#define _IOCPDF_IOCPDF3_MASK                     0x00000008
#define _IOCPDF_IOCPDF3_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF4_POSITION                 0x00000004
#define _IOCPDF_IOCPDF4_MASK                     0x00000010
#define _IOCPDF_IOCPDF4_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF5_POSITION                 0x00000005
#define _IOCPDF_IOCPDF5_MASK                     0x00000020
#define _IOCPDF_IOCPDF5_LENGTH                   0x00000001

